# coding: utf-8
"""
ストップワード, ストップ品詞の定義
"""

WORDS_FOR_CONTENTS = [
    # 形容詞のストップワード
    # 固有の意味が薄く多用されるワード
    "ない",
    "高い",
    "多い",
    "少ない",
    "強い",
    "大きい",
    "小さい",
    "良い",

    # 動詞のストップワード
    "ある",
    "いる",
    "なる",
    "行く",
    "いる",
    "とる",
    "見る",
    "みる",
    "言う",
    "いう",
    "得る",
    "過ぎる",
    "すぎる",
    "する",
    "やる",
]

HINSHI_FOR_CONTENTS = {
    "品詞": ["連体詞", "接続詞", "助詞", "助動詞", "連語", "副詞", "接頭語"],
    "品詞細分類1": ["形容動詞語幹", "副詞可能", "代名詞", "ナイ形容詞互換", "特殊", "数", "接尾", "非自立"],
}


HANKAKU_PATTARN = r"[!-/:-@[-`{-~]"